#### terraform plan every: 469e765
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.lambda-sample.aws_lambda_layer_version.lambda_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:1]
module.lambda-sample.aws_iam_role.lambda_iam_role: Refreshing state... [id=lambda_sample_python_iam_role]
module.lambda-sample.aws_api_gateway_rest_api.discord_endpoint: Refreshing state... [id=9kj5r3gk4m]
module.lambda-sample.aws_api_gateway_resource.proxy: Refreshing state... [id=6pb4us]
module.lambda-sample.aws_api_gateway_method.proxy: Refreshing state... [id=agm-9kj5r3gk4m-6pb4us-ANY]
module.lambda-sample.aws_iam_role_policy.lambda_access_policy: Refreshing state... [id=lambda_sample_python_iam_role:lambda_sample_python_lambda_access_policy]
module.lambda-sample.aws_lambda_function.lambda_function: Refreshing state... [id=lambda_sample_python_function]
module.lambda-sample.aws_api_gateway_integration.lambda: Refreshing state... [id=agi-9kj5r3gk4m-6pb4us-ANY]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambda-sample.aws_api_gateway_deployment.example will be created
  + resource "aws_api_gateway_deployment" "example" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "9kj5r3gk4m"
      + stage_name    = "test"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "cert_arn" but a value was
found in file "dev.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*